Repository: db1ex3/cellstore
Catalog: po/*.po
Languages: ro

source: This repository contains financial information provided to the US Securities and Exchange Commission (SEC) by public companies using the XBRL global standard technical syntax. Submitted XBRL information contained in the filings is read by the system, converted to a format which is optimized for query (as opposed to XBRL which is optimized for information exchange), and stored in a database in that queriable format. Additional metadata is added to the system which is commonly used when querying this financial information. Please note that only financial information provided within SEC forms 10-Q and 10-K is provided via this system.
ro: Acest depozit conține informații financiare furnizate la Securities and Exchange Commission din SUA (SEC) de către companii publice care folosesc XBRL. Informațiile XBRL prezentate conținute în raporari sunt citite de sistem, transformate într-un format care este optimizată pentru interogare (spre deosebire de XBRL care este optimizat pentru schimbul de informații), și stocate într-o bază de date. Metadate suplimentare sunt adaugate de sistem, folosite pentru interogarea acestor informații financiare. Vă rugăm să rețineți că numai informațiile financiare furnizate în cadrul raportarilor 10-Q si 10-K sunt disponibile prin intermediul acestui sistem.

source: Ticker Symbol
ro: Simbol

source: To view that information you have to login with your credentials. If you do not have an account, you can create one using the <a href="/auth">registration form</a>.
ro: Pentru a accesa aceaste informații trebuie să vă autentificați. Dacă nu aveți cont, puteti să creați unul folosind <a href="/auth">forma de inregistrare</a>.

source: To view that information you have to login with your credentials. If you do not have an account, you can create one using the registration form.
ro: Pentru a accesa aceaste informații trebuie să vă autentificați. Dacă nu aveți cont, puteti să creați unul folosind forma de inregistrare.

source: Toggle navigation
ro: Afişează/ascunde meniul

source: Token
ro: Cheie

source: Type
ro: Tip

source: UI access
ro: Acces la interfața

source: US Public Company<br>Financial Information<br>Repository
ro: Informații Financiare<br>Despre Companii<br>Publice Americane

source: Unit
ro: Unitate

source: Unlimited API calls
ro: Număr nelimitat de apeluri ale API

source: Unlimited Users
ro: Număr nelimitat de utilizatori

source: Update Billing Information
ro: Actualizează Informații Facturare

source: Update Profile
ro: Actualizează Profil

source: Updating Profile...
ro: Se actualizează profilul...

source: Using the <a href="http://28.io/xbrl">28.io</a> information processing platform, XBRL can be stored in a way that is optimized for querying
ro: Folosind platforma de procesare a informatiilor <a href="http://28.io/xbrl">28.io</a>, XBRL este stocat intr-un format proprietar, care permite optimizarea query-urilor

source: Value
ro: Valoare

source: View as
ro: Vezi ca

source: XBRL Instance
ro: Instanta XBRL

source: Yes
ro: Da

source: You are about to change your password.
ro: Această operațiune va schimba parola contului.

source: You are accessing filings for entities that are not part of DOW30.
ro: Incercați sa accesați raportări ale unor entitați care nu fac parte din DOW30.

source: You are trying to compare information across {{filings.length}} filings.
ro: Incercați sa comparați informații de pe {{filings.length}} raportări.

source: You can create your own XBRL-based information repository using the same approach, no programming required, just configure settings. You build your own XBRL taxonomy, submit XBRL instances, and you are in business in just a couple of hours. Or, if you need more flexibility, you can even modify existing application profiles to fit your needs or even create your own application profile.
ro: Poti sa iti creezi propriile analize bazate pe XBRL, nefolosind cunostinte de programare, doar customizand setarile. Poti sa iti creezi propria taxonomie XBRL, sa submitezi propriile instante XBRL, si in cateva ore poti crea analize detaliate. Sau, daca ai nevoie de flexibilitate mai mare, poti modifica profilele existente pentru a acomoda necesitatile.

source: Your account is restricted to compare 30 filings at a time. Please <a href="mailto:hello@28.io">contact us</a> to talk about your use case.
ro: Conturile sunt limitate la comparații de maxim 30 de raportări deodata. Vă rugăm <a href="mailto:hello@28.io">să ne contactați</a> să discutăm scenariul in care acest număr este prea mic.

source: Your domain &amp; your SSL certificate
ro: Domeniul &amp; certificatul (SSL) dumneavoastră

source: a mistyped address
ro: o adresă gresită

source: a regulator can specify that the IFRS taxonomy be used to submit information, specify a few configuration settings, and specify XBRL-based business rules. Your repository can be up and running in hours.
ro: o organizatie de reglementare poate folosi taxonomia IFRS, personaliza cateva setari, si sa foloseasca reguli de business bazate pe XBRL pentru a crea o sursa de date coerenta in cateva ore.

source: an out-of-date link
ro: o adresă care nu mai este de actualitate

source: {{more}} older.
ro: {{more}} mai vechi.
