Repository: db1ex3/cellstore
Catalog: po/*.po
Languages: ro

source: $49 / month (1 month trial)
ro: $49 / lună (o lună de probă)

source: 1000 API calls per month
ro: 1000 apeluri de API pe lună

source: 2013 28msec Inc. All rights reserved.
ro: 2013 28msec Inc. Toate drepturile rezervate.

source: ADD ENTITY
ro: ADAUGĂ ENTITATE

source: ADD ENTITY GROUP
ro: ADAUGĂ GRUP DE ENTITĂȚI

source: ADD FISCAL PERIODS
ro: ADAUGĂ PERIOADE FISCALE

source: ADD FISCAL YEARS
ro: ADAUGĂ ANI FISCALI

source: ADD INDUSTRY GROUP
ro: ADAUGĂ GRUP INDUSTRIAL

source: API Tokens
ro: Chei de API

source: API access
ro: Access API

source: API calls in billing cycle
ro: Număr de apeluri API in perioada de plată

source: About secxbrl.info
ro: Despre secxbrl.info

source: Abstracts
ro: Abstracte

source: Accepted
ro: Acceptat

source: Accepted by SEC
ro: Acceptat de SEC

source: Access to DOW30 filings
ro: Acces la raportările DOW30

source: Access to all SEC filings
ro: Acces la toate raportările SEC

source: Accession Number
ro: Număr de clasificare

source: Account Management
ro: Administrare Cont

source: Action
ro: Acțiuni

source: Adapt API for your sophisticated queries
ro: Adaptează API pentru nevoi mai sofisticate

source: Add
ro: Adaugă

source: Affordable Access to Financial Information
ro: Acces la Informațiile Financiare la preț rezonabil

source: All Examples
ro: Toate Exemplele

source: All data as:
ro: Datele ca:

source: Amount
ro: Suma

source: Archives
ro: Arhive

source: Axis
ro: Axa

source: Balance
ro: Balanța

source: Base Type
ro: Tip de Bază

source: Basic Analysis
ro: Analiză

source: Basic Financial Information
ro: Informații Financiare

source: Basic Semantic Validations
ro: Validări Semantice

source: Billing
ro: Facturare

source: Billing information
ro: Informații Facturare

source: Breakdown General Electric’s 2013 Assets by Business Segments.
ro: Distribuția pe sectoare de business a Activelor General Electric in 2013

source: Bring your own filings
ro: Foloseşte propriile raportări

source: Browse
ro: Navighează

source: Browse DOW30
ro: Vezi DOW30

source: Cancel subscription
ro: Anulează abonamentul

source: Canceled on {{sub.canceledAt | date }}.
ro: Anulat pe {{sub.canceledAt | date }}.

source: Category
ro: Categorie

source: Change Password
ro: Schimbare Parola

source: Changing Password...
ro: Parola se schimbă...

source: Choose password
ro: Alege parola

source: Closest Schema Builtin Type
ro: Cel mai apropiat tip de bază

source: Company Name is required.
ro: Numele Companiei este obligatoriu.

source: Compare
ro: Compară

source: Compare Accuracy Measurements of Basic Financial Information Across Selected Filings
ro: Compară cu acuratețe Informații Financiare intre raportările selectate

source: Compare Basic Financial Information Across Selected Filings
ro: Compară Informații Financiare intre raportările selectate

source: Compare or aggregate facts across filings, entities, periods, or sectors. Filter by any combination of explicit dimensions. Easily deal with amendments or duplicated information. Apply custom mappings of synonymous concepts. Use business rules to compute unreported facts or key ratios.
ro: Compară si agregă valori din raportari, entitati, perioade fiscale sau sectoare. Aplică filtre multiple pe dimensiuni explicite. Rezolvă cu usurintă amendamentele sau informatia duplicată. Aplică mapări personalizate pentru concepte sinonime. Foloseste reguli de business pentru calculul unor valori nedeclarate sau indicatori cheie.

source: Compare the DOW30's latest filings using fundamental accounting concepts.
ro: Compară ultimele raportari ale companiilor din DOW30 utilizand concepte similare

source: Complete database of U.S. public company financial information. User-friendly and affordable access.
ro: Baza de date completa a informații financiare despre companiile publice americane. Interfață prietenoasă si acces la costuri rezonabile.

source: Component
ro: Componentă

source: Component Details
ro: Detalii Componentă

source: Component ID
ro: ID Componentă

source: Component Label / Name
ro: Nume Componentă

source: Components
ro: Componente

source: Compute - in real time - the sum of all values reported against the concept us-gaap:Assets, on all 10-K SEC XBRL financial filings, aggregated by fiscal period.
ro: Calculează - in timp real - suma tuturor valorilor raportate pentru conceptul us-gaap:Assets, de pe toate raportarile financiare SEC 10-K, grupat dupa perioada fiscală.

source: Compute analytics based on information extracted from the SEC filings
ro: Calculează analize bazate pe informații extrase din raportările SEC

source: Concept map
ro: Mapare concepte

source: Concepts
ro: Concepte

source: Contact Us
ro: Contactați-ne

source: Create Your Own Business Information Repository
ro: Crează-ti Propria Sursa de Informații Financiare

source: Create new token
ro: Crează cheie

source: Create reports the way you need them. Add aggregates, ratios, or external information. Create your own validation or verification rules. Compare across competitors or sectors.
ro: Crează rapoartele de care ai nevoie. Adaugă formule, indicatori sau informatii din surse externe. Crează reguli de validare si verificare. Compară valorile intre competitori si sectoare.

source: Custom Reports
ro: Rapoarte Personalizate

source: DISCLAIMER: All information provided is as reported by the reporting entity and has not been adjusted to correct for errors. This repository is a working prototype created using 28.io and is intended to be a demonstration of 28.io. This information repository should not be relied upon for financial analysis or for making investment decisions.
ro: ATENTIE: Toate informațiile furnizate sunt exact cum sunt raportate de către entitate și nu au fost ajustate pentru a corecta erorile. Acest depozit este un prototip creat folosind 28.io și se dorește a fi o demonstrație a platformei 28.io. Acest depozit de informații nu ar trebui să fie folosit ca baza pentru analiza financiară sau pentru luarea deciziilor de investiții.

source: Data Type
ro: Tip de data

source: Data as:
ro: Datele ca:

source: Date
ro: Data

source: Decimals
ro: Zecimale

source: Description
ro: Descriere

source: Dimensions
ro: Dimensiuni

source: Disclosure
ro: Declarație

source: Disclosure Name
ro: Nume Declarație

source: Disclosures
ro: Declarații

source: ENTITIES OR ENTITY GROUPS
ro: ENTITATE SAU GRUP DE ENTITATI

source: Email and Password do not match our records.
ro: Combinatia Email/Parola nu se regaseste in sistem.

source: Email is invalid.
ro: Email invalid.

source: Email is required.
ro: Email este obligatoriu.

source: Enter Billing Information
ro: Introduceți Informațiile de Facturare

source: Enter your credentials below. If you do not have an account, you can create one using the registration form.
ro: Introduceți email si parola. Daca nu aveți cont puteți sa creați unul folosind ecranul de inregistrare.

source: Entities
ro: Entitați

source: Entity
ro: Entitate

source: Entity Information
ro: Informații Entitate

source: Entity Registrant Name
ro: Nume Legal Entitate

source: Entity Summary
ro: Sumar Entitate

source: Entity Type
ro: Tip Entitate

source: Example
ro: Exemplu

source: Expires on
ro: Expira la

source: Expires on {{sub.expiresAt | date }}.
ro: Expira la {{sub.expiresAt | date }}.

source: Expiring
ro: Expira

source: Extension Abstracts
ro: Extensii Abstracte

source: Extension Concepts
ro: Extensii Concepte

source: Extension Facts
ro: Extensii Valori

source: FISCAL PERIOD
ro: PERIOADA FISCALA

source: FISCAL PERIODS
ro: PERIOADE FISCALE

source: FISCAL YEAR
ro: AN FISCAL

source: FISCAL YEARS
ro: ANI FISCALI

source: FUNDAMENTAL ACCOUNTING
ro: CONTABILITATE FUNDAMENTALA

source: Fact Table
ro: Tabel de valori

source: Facts
ro: Valori

source: Failed
ro: Esuat

source: Featured Users
ro: Clienții Nostri

source: Filing
ro: Declarație

source: Filing Components
ro: Componente Declarație

source: Filing Details
ro: Detalii Declarație

source: Filings
ro: Raportări

source: Filings for {{filings[0].EntityRegistrantName}} ({{filings[0].CIK.substr(23)}})
ro: Raportări ale {{filings[0].EntityRegistrantName}} ({{filings[0].CIK.substr(23)}})

source: Filings included in the filter
ro: Raportări incluse in filtru

source: Find components by
ro: Caută componente după

source: Find report elements by
ro: Caută elemente după

source: First Name
ro: Prenume

source: First Name is required.
ro: Prenume este obligatoriu.

source: Fiscal Period
ro: Perioadă Fiscală

source: Fiscal Period / Year
ro: Perioadă / An Fiscal

source: Fiscal Year
ro: An Fiscal

source: Footnotes
ro: Note de subsol

source: Forgot Password
ro: Am uitat parola

source: Forgot password?
ro: Ai uitat parola?

source: Form
ro: Formular

source: Form Type
ro: Tip Formular

source: Free
ro: Gratis

source: Go to
ro: Actiune

source: Hello {{email}}
ro: Salut {{email}}

source: Here are some working examples: <a href="/comparison/components?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;disclosure=BalanceSheet">Balance Sheets for DOW30 in 2013</a> or <a href="/comparison/components?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;reportElement=us-gaap:Assets">Components containing us-gaap:Assets of Coca Cola and Walmart throughout 2012</a>
ro: Iată cateva exemple: <a href="/comparison/components?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;disclosure=BalanceSheet">Balanțele firmelor din DOW30 in anul 2013</a> sau <a href="/comparison/components?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;reportElement=us-gaap:Assets">Evoluția componentei us-gaap:Assets pentru Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Here are some working examples: <a href="/comparison/filings?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Filings for DOW30 in 2013</a> or <a href="/comparison/filings?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Coca Cola and Walmart filings throughout 2012</a>
ro: Iată cateva exemple: <<a href="/comparison/filings?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Raportările firmelor din DOW30 in anul 2013</a> sau <a href="/comparison/filings?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Raportările Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Here are some working examples: <a href="/comparison/information?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Basic financial information for DOW30 in 2013</a> or <a href="/comparison/information?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Basic financial information for Coca Cola and Walmart throughout 2012</a>
ro: Iată cateva exemple: <a href="/comparison/information?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Informațiile Financiare ale firmelor din DOW30 in anul 2013</a> sau <a href="/comparison/information?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Informațiile Financiare ale Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Here are some working examples: <a href="/comparison/reportElements?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;label=Assets">Assets for DOW30 in 2013</a> or <a href="/comparison/reportElements?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;name=us-gaap:Assets">Report Element us-gaap:Assets of Coca Cola and Walmart throughout 2012</a>
ro: Iată cateva exemple: <a href="/comparison/reportElements?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;label=Assets">Activele firmelor din DOW30 in anul 2013</a> sau <a href="/comparison/reportElements?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;name=us-gaap:Assets">Evoluția elementului us-gaap:Assets pentru Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Here are some working examples: <a href="/comparison/search?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;map=FundamentalAccountingConcepts&amp;concept=fac:Revenues">Revenues for DOW30 in 2013</a> or <a href="/comparison/search?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;concept=us-gaap:Assets">Assets for Coca Cola and Walmart throughout 2012</a>
ro: Iată cateva exemple: <a href="/comparison/search?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY&amp;map=FundamentalAccountingConcepts&amp;concept=fac:Revenues">Veniturile firmelor din DOW30 in anul 2013</a> sau <a href="/comparison/search?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1&amp;concept=us-gaap:Assets">Activele Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Here are some working examples: <a href="/comparison/validations-dashboard?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Basic semantic validations for DOW30 in 2013</a> or <a href="/comparison/validations-dashboard?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Basic semantic validations for Coca Cola and Walmart throughout 2012</a>
ro: Iată cateva exemple: <a href="/comparison/validations-dashboard?tag=DOW30&amp;fiscalYear=2013&amp;fiscalPeriod=FY">Validări semantice pentru firmele din DOW30 in anul 2013</a> sau <a href="/comparison/validations-dashboard?cik=0000104169&amp;cik=0000021344&amp;fiscalYear=2012&amp;fiscalPeriod=FY&amp;fiscalPeriod=Q3&amp;fiscalPeriod=Q2&amp;fiscalPeriod=Q1">Validări semantice pentru Coca Cola si Walmart de-a lungul intregului an 2012</a>

source: Hit
ro: Rand

source: Hits
ro: Randuri

source: Home
ro: Acasă

source: INDUSTRY GROUP
ro: GRUP INDUSTRIAL

source: In addition to the GUI (graphical user interface) an <a href="/api">API</a> (application programming interface) is also provided. Using the API information can be retrieved about entities, the filings made by those entities, the components contained within those filings, the model structure of a component, or the facts reported within a component. All information is provided in the following formats: JSON (the default), XML, CSV, and Excel.
ro: In afara interfeței grafice (GUI), un <a href="/api">API</a> este oferit. Folosind API-ul, se pot obține informații despre entități, raportări, componentele acestora, modelul structural al componentelor sau valori raportate pentru o componentă. Informațiile sunt disponibile in format JSON, XML, CSV sau Excel.

source: Industry Sector
ro: Sector Industrial

source: Information relating to the entities which make up the DOW 30 is provided without login. Please note that information outside of the DOW30 can only be accessed using a valid token that can be retrieved by creating an account on http://www.secxbrl.info and login is done using the Session API.
ro: Informațiile aferente companiilor din DOW30 sunt disponibile fără o autentificare prealabilă. De menționat că informațiile companiilor care nu fac parte din DOW30 sunt accesibile doar folosind o cheie de autentificare. Acestea pot fi create fie prin utilizarea interfeței grafice, după crearea unui cont pe http://www.secxbrl.info sau prin folosirea API-ului Session.

source: Invoice ID
ro: ID Factura

source: Invoices
ro: Facturi

source: Is a Trust
ro: Este trust

source: It looks like this was the result of either:
ro: Posibile motive:

source: Label
ro: Denumire

source: Last Name
ro: Nume

source: Last Name is required.
ro: Numele este obligatoriu.

source: Learn More.
ro: Afla mai multe.

source: Liabilities vs. Equity
ro: Pasive vs. Capital

source: Line Items
ro: Randuri

source: Load more...
ro: Mai multe...

source: Loading
ro: Se incarcă

source: Loading billing information...
ro: Se incarcă informațiile de facturare...

source: Loading invoices...
ro: Se incarcă facturile...

source: Loading subscriptions...
ro: Se incarcă abonamentele...

source: Login
ro: Autentificare

source: Login / Sign-Up
ro: Autentificare / Înregistrare

source: Login or Sign-Up
ro: Autentificare sau Înregistrare

source: Members
ro: Membri

source: Model Structure
ro: Model Structural

source: Model Structure for {{EntityRegistrantName}}<br>({{FiscalPeriod}} / {{FiscalYear}})
ro: Model Structural pentru {{EntityRegistrantName}}<br>({{FiscalPeriod}} / {{FiscalYear}})

source: Name
ro: Nume

source: Name / Label
ro: Nume / Denumire

source: Name of a contained report element
ro: Numele elementului continut

source: Name of the report element
ro: Numele elementului

source: Net Income vs. Revenue
ro: Venituri Nete vs. Venituri

source: Network
ro: Rețea

source: Network Description
ro: Descriere Rețea

source: Network Identifier
ro: Identificator Rețea

source: Network Label / Name
ro: Denumire / Nume Rețea

source: Network title
ro: Titlu Rețea

source: Networks
ro: Rețele

source: Nevermind, I remembered!
ro: Mi-am amintit!

source: New password
ro: Parola noua

source: Nillable
ro: Null

source: No
ro: Nu

source: No account or credit card required
ro: Nu este nevoie de cont sau card de credit

source: No billing information present
ro: Nu sunt informații de facturare

source: No dimension filters used.
ro: Nu se folosesc filtre dimensionale.

source: No invoices.
ro: Nu sunt facturi.

source: No results found.
ro: Nu sunt rezultate.

source: No subscriptions.
ro: Nu sunt abonamente.

source: NoLAP extends the OLAP paradigm by removing hypercube rigidity and letting users generate their own hypercubes on the fly on the same pool of (fact) values.
ro: NoLAP extinde paradigma OLAP eliminand rigiditatea cuburilor si lasand userii sa-si genereze propriile hyper-cuburi in timp real, pe aceeasi sursa de date.

source: Not found <span>:(</span>
ro: Nu s-a gasit <span>:(</span>

source: Object Class
ro: Clasa de Obiecte

source: Old password
ro: Parola veche

source: Old password doesn't match our records.
ro: Parola veche nu este corectă.

source: Old password is required.
ro: Parola veche este obligatorie.

source: One user
ro: Un utilizator

source: Origin
ro: Origine

source: Passed
ro: Corect

source: Password
ro: Parola

source: Password confirmation doesn't match.
ro: Cele 2 parole nu corespund.

source: Password confirmation is required.
ro: Parola confirmată este obligatorie.

source: Password confirmation must exceed 5 characters.
ro: Parola confirmată trebuie sa aiba cel putin 5 caractere.

source: Password is required.
ro: Parola este obligatorie.

source: Password must exceed 5 characters.
ro: Parola trebuie sa aiba cel putin 5 caractere.

source: Payment method
ro: Mod de plată

source: Perform truly interactive data analysis. Get answers to even the most sophisticated queries in seconds. Slice and dice, drill down, everything in real-time.
ro: Efectuați analiza datelor cu adevarat in mod interactiv. Primeste raspuns la cele mai sofisticate query-uri in secunde.

source: Period
ro: Perioadă

source: Period Type
ro: Tip Perioadă

source: Please <a ng-click="updateBillingInfo()">enter your billing information</a> before you sign up.
ro: <a ng-click="updateBillingInfo()">Introduceți informațiile de facturare</a> inainte sa vă abonați.

source: Posted {{formatDate(entry.updated)}} ago
ro: Publicat {{formatDate(entry.updated)}} in urma

source: Powered by <a href="http://28.io/xbrl">28.io</a>
ro: Realizat de <a href="http://28.io/xbrl">28.io</a>

source: Powered with <i class="fa fa-heart-o"></i> by <a href="http://28.io/xbrl">28.io</a>
ro: Realizat cu <i class="fa fa-heart-o"></i> de <a href="http://28.io/xbrl">28.io</a>

source: Pricing
ro: Prețuri

source: Privacy Policy
ro: Politica de confidențialitate

source: Pro Includes
ro: Pro Include

source: Profile
ro: Profil

source: Profile Information
ro: Informații Profil

source: Queries API
ro: API Queries

source: Read more →
ro: Citeste mai departe →

source: Real-Time
ro: In Timp Real

source: Register
ro: Înregistrare

source: Related Examples
ro: Exemple Similare

source: Report Element
ro: Element de Raportare

source: Report Elements
ro: Elemente de Raportare

source: Report element name
ro: Nume element de raportare

source: Request
ro: Cerere

source: Request Parameters
ro: Parametrii cererii

source: Resource Overview
ro: Resurse

source: Response Status Codes
ro: Coduri de Status cereri

source: Restricted access
ro: Acces restricționat

source: Retrieve facts from all filings
ro: Obține valorile pentru toate raportările

source: Retype new password
ro: Parola noua din nou

source: Revoke
ro: Anulează

source: Rules Not Applicable
ro: Reguli Neaplicabile

source: SEC Filing Page
ro: Raportările Financiare la SEC

source: SEC Preview
ro: Preview SEC

source: SEC XBRL API
ro: API SEC XBRL

source: SECXBRL.info is a prototype repository built on top of <a href="http://28.io/xbrl">28.io</a>.
ro: SECXBRL.info este un prototip construit pe platforma <a href="http://28.io/xbrl">28.io</a>.

source: SIC Code
ro: Cod Industrial

source: SIC Description
ro: Descriere Cod Industrial

source: Scalable processing power
ro: Putere de procesare scalabila

source: Search
ro: Caută

source: Search Components
ro: Caută Componente

source: Search Entity
ro: Caută Entitate

source: Search Facts
ro: Caută Valoare

source: Search Report Elements
ro: Caută Elemente de Raportare

source: Selected Filters
ro: Filtre Active

source: Send me help
ro: Trimite-mi ajutor

source: Session API
ro: API Session

source: Set Filters
ro: Seteaza Filtrele

source: Show Text
ro: Arată Text

source: Sign Up
ro: Înregistrare

source: Sign Up for Pro
ro: Abonare la Pro

source: Sign Up to access all SEC dataset
ro: Aboneaza-te pentru a accesa toate informațiile SEC

source: Sophisticated Semantic Analysis
ro: Analiză Semantică Sofisticată

source: Sorry, but the page you were trying to view does not exist.
ro: Ne pare rău, dar pagina căutată nu există.

source: Sub Category
ro: Sub Categorie

source: Subscribed to <b>{{sub.plan.name}}</b> since {{sub.activatedAt | date }}
ro: Abonat la <b>{{sub.plan.name}}</b> de la data {{sub.activatedAt | date }}

source: Subscription
ro: Abonament

source: Substitution Group
ro: Grup de Substituție

source: Success Rate
ro: Rata Succes

source: Summary
ro: Sumar

source: Support
ro: Ajutor

source: Table
ro: Tabel

source: Table Name
ro: Nume Tabel

source: Tables
ro: Tabele

source: Tailored to your needs
ro: Croit pe nevoile dumneavoastră

source: Target Concepts
ro: Concepte Tintă

source: Terms of Use
ro: Termeni de utilizare

source: Text Block
ro: Bloc Text

source: Text contained in label of the report element
ro: Text conținut in denumirea elementului de raportare

source: Text contained in network titles
ro: Text conținut in titlurile rețelelor

source: The page you are trying to access displays information about an entity not included in the DOW30.
ro: Pagina cautată accesează informații despre entitați in afara DOW30.
